Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionOrthogonal Constructor
Overload List
Name | Description
CurvedDimensionOrthogonal(ViewBase, Point, Point, Point, Point, Point, Double)
 Creates a new curved dimension with orthogonal reference lines using default attributes.
CurvedDimensionOrthogonal(ViewBase, Point, Point, Point, Point, Point, Double, CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes)
 Creates a new curved dimension with orthogonal reference lines.
Top
See Also
Reference
CurvedDimensionOrthogonal Class
Tekla.Structures.Drawing Namespace